// clock_no_RTC_II by EASYAMPER 

#include <LiquidCrystal.h>                  // библиотека для дисплея
LiquidCrystal lcd(8, 9, 4, 5, 6, 7);       // для работы дисплея

int h;             //     для часов
int m;             //     для минут
int s;             //     для секунд
unsigned long t;   //     для исчисления времени
                   //        (принимает большие значения)
unsigned long b;   //     для кнопок , настройки времени
int v;             //     для смены режимов визуализации 
void setup() {

  lcd.begin(16, 2);
  lcd.print ("EASY AMPER show");     // заставка в начале работы
  delay(400);
  lcd.setCursor(0, 1);
  lcd.print ("clock no RTC II");        
  delay(3400);
  lcd.clear();                       // конец заставки , очистка дисплея
}

void loop() {
  int k =  analogRead(A0);            // приравниваем переменную(для кнопок)
                                     //  к значению с пина A0
  /////////////////////////////////////////////////////////////
  // блок счёта времени
  
  if (millis() - t > 1000){        // код для счёта секунд
    t = millis();
    s=s+1;
  }

  if (s == 60) {              // вычисление минут и часов по секундам
    s = 0;                    // в 1ой минуте 60 сек
    m = m + 1;
    lcd.clear();
  }
  if (m == 60) {              // в 1ом часе 60 минут
    m = 0;
    h = h + 1;
  }
  if (h == 24) {             // день в среднем равен 24 часа
    h = 0;
    m = 0;                   //   сброс счётчика , можно добавить
    s = 0;                   //   счёт дней, добавив переменную
  }
  
  /////////////////////////////////////////////////////////////
  // блок настройки времени
  if (k >= 0 && k < 100) {
  if (millis() - b > 300){        
    b = millis();
    m = m + 1  ;               //   RIGHT  - добавить минуту
   if (m >= 60) {
     m = 0;
     lcd.clear();
   }
   }
   }
  if (k >= 100 && k < 200) {
    if (millis() - b > 300){        
    b = millis();
    m = m + 10;               //   UP   - добавить 10 минут
    if (m >= 60) {
      m = 0;
      lcd.clear();
    }
    }
    }
  if (k >= 200 && k < 400) {
    if (millis() - b > 300){        
    b = millis();
     v=v+1;            //   DOWN  - смена режимов визуализации минуты
     lcd.clear();
    }
    if (v>5)v=1;
    }
  if (k >= 400 && k < 600) {
    if (millis() - b > 300){        
    b = millis();
    h = h + 10;              //   LEFT    -   добавить 10 часов
    if (h >= 24) {           //   защита от перебора значения(во всех)
      h = 0;
      lcd.clear();
    }
    }
    }
  if (k >= 600 && k < 800) {
    if (millis() - b > 300){        
    b = millis();
    h = h + 1;               //   SELECT    -   добавить 1 час
    if (h >= 24) {
      h = 0;
      lcd.clear();           //   очищаем для удаления возможных старых значений
    }
    }
    }
    
  /////////////////////////////////////////////////////////////
  // блок вывода времени на дисплей
  lcd.setCursor(2, 0);       //   установка курсора
  lcd.print (h);             //   вывод часов
  lcd.print (" : ");         //   вывод разделителя
  lcd.print (m);             //   вывод минут
  lcd.print (" : ");         //   вывод разделителя
  lcd.print (s);             //   вывод секунд
  /////////////////////////////////////////
  // визуальные эффекты заполнения минуты на нижней строчке дисплея
  if (v==1){
  lcd.setCursor(0, 1);          // эффект номер 1, также возможно 
  lcd.print ("|");              //         отключить эффекты  
  if (s == 10) {
    lcd.print ("||");
  }
  if (s == 15) {
    lcd.print ("|||");
  }
  if (s == 20) {
    lcd.print ("||||");
  }
  if (s == 25) {
    lcd.print ("|||||");
  }
  if (s == 30) {
    lcd.print ("||||||");
  }
  if (s == 35) {
    lcd.print ("||||||||");
  }
  if (s == 40) {
    lcd.print ("||||||||||");
  }
  if (s == 45) {
    lcd.print ("|||||||||||");
  }
  if (s == 50) {
    lcd.print ("|||||||||||||");
  }
  if (s == 55) {
    lcd.print ("||||||||||||||");
  }
  if (s == 58) {
    lcd.print ("||||||||||||||||");
  }
  }

   if (v==2){
  lcd.setCursor(0, 1);       // эффект 2 
  lcd.print ("=");
  if (s == 10) {
    lcd.print ("==");
  }
  if (s == 15) {
    lcd.print ("===");
  }
  if (s == 20) {
    lcd.print ("====");
  }
  if (s == 25) {
    lcd.print ("=====");
  }
  if (s == 30) {
    lcd.print ("======");
  }
  if (s == 35) {
    lcd.print ("========");
  }
  if (s == 40) {
    lcd.print ("==========");
  }
  if (s == 45) {
    lcd.print ("===========");
  }
  if (s == 50) {
    lcd.print ("=============");
  }
  if (s == 55) {
    lcd.print ("==============");
  }
  if (s == 58) {
    lcd.print ("================");
  }
  }

 if (v==3){
  lcd.setCursor(0, 1);        // эффект 3
  lcd.print ("*");
  if (s == 10) {
    lcd.print ("**");
  }
  if (s == 15) {
    lcd.print ("***");
  }
  if (s == 20) {
    lcd.print ("****");
  }
  if (s == 25) {
    lcd.print ("*****");
  }
  if (s == 30) {
    lcd.print ("******");
  }
  if (s == 35) {
    lcd.print ("********");
  }
  if (s == 40) {
    lcd.print ("**********");
  }
  if (s == 45) {
    lcd.print ("***********");
  }
  if (s == 50) {
    lcd.print ("*************");
  }
  if (s == 55) {
    lcd.print ("**************");
  }
  if (s == 58) {
    lcd.print ("***************");
  }
  }

  if (v==4){
  lcd.setCursor(0, 1);            // эффект 4
  lcd.print ("$");
  if (s == 10) {
    lcd.print ("$$");
  }
  if (s == 15) {
    lcd.print ("$$$");
  }
  if (s == 20) {
    lcd.print ("$$$$");
  }
  if (s == 25) {
    lcd.print ("$$$$$");
  }
  if (s == 30) {
    lcd.print ("$$$$$$");
  }
  if (s == 35) {
    lcd.print ("$$$$$$$$");
  }
  if (s == 40) {
    lcd.print ("$$$$$$$$$$");
  }
  if (s == 45) {
    lcd.print ("$$$$$$$$$$$");
  }
  if (s == 50) {
    lcd.print ("$$$$$$$$$$$$$");
  }
  if (s == 55) {
    lcd.print ("$$$$$$$$$$$$$$");
  }
  if (s == 59) {
    lcd.print ("$$$$$$$$$$$$$$$$");
  }
  }
  
  /////////////////////////////////////////////////////////////
  // конец :-)
}
